{
  "present": "presente",
  "learnMore": "Ver más!",
  "mainTitle": "Soy un Desarrollador de Software",
  "myResume": "Mira mi hoja de vida!",
  "softwareEngineer": "Ingeniero de Software",
  "resumeLink": "/files/HV Mateo Devia.pdf",
  "mySkills": "Mis conocimientos",
  "myExperience": "Mi experiencia",
  "responsibilities": "Responabilidades",
  "achievements": "Logros",
  "headOfBackend": "Director de Backend",
  "headOfBackendDescription": "Trabajo tiempo completo liderando un equipo de 26 ingenieros que construye una plataforma de inversión basada en microservicios y APIs modernas sobre una arquitectura serverless, utilizando TypeScript, AWS, GitHub Actions, entre otras tecnologías.",
  "tybaLongDescription": "Trabajé como ingeniero backend en tyba, una Fintech que se dedica a ofrecer oportunidades de inversion a sus usuarios mediante soluciones tecnológicas innovadoras.",
  "tybaResponsibilities": "- Diseño y desarrollo de nuevas funcionalidades en la app \n- Mejoramiento continuo de los componentes de software \n- Soporte y solución de bugs en la app",
  "tybaPage": "Página de tyba",
  "inalambriaRole": "Ingeniero fullstack de innovación",
  "inalambriaDescription": "Ingeniero del área de innovación encargado del diseño, concepción, e implementación de nuevos productos para la empresa.",
  "inalambriaLongDescription": "Mi primer trabajo tiempo completo fue en Inalambria, una empresa dedicada a la mensajería instantanea. Fuí parte del equipo de Innovación, donde tuve la oportunidad de diseñar y desarrollar nuevos productos de software para la empresa.",
  "inalambriaResponsabilities": "- Diseño y desarrollo de nuevos productos de software \n- Implementación del ambiente de CI/CD \n- Diseño de arquitecturas para productos altamente escalables \n- Mantenimiento de productos en AWS",
  "inalambriaPage": "Página de Inalambria",
  "cumLaudeTitle": "Grado Cum Laude",
  "cumLaudeDescription": "Grado Cum Laude en Ingeniería de Sistemas y Computación con promedio dentro del 3% más alto en los últimos 5 años de la facultad de ingeniería",
  "cumLaudeLongDescription": "Me gradué del pregrado de Ingeniería de Sistemas y Computación de la Universidad de los Andes con el reconocimiento Cum Laude.El reconocimiento cum laude se otorga a los estudiantes cuyo promedio ponderadao está dentro del 3% más alto de la Facultad de ingeniería en los últimos 5 años",
  "sincoFreelance": "Contrato como independiente",
  "sincoDescription": "Desarrollo de aplicación web para gestión de contenido multimedia, contacto con los clientes, y gestión de cursos sobre el ERP.",
  "cupi2Title": "Asistente de investigación en Python",
  "cupi2Description": "Asistente de Investigación encargado de administrar el centro de ayuda para estudiantes de los cursos de introducción a la programación en Python, y apoyar la migración de Java a Python en dichos cursos.",
  "arquisoftTitle": "Monitor de arquitectura y diseño de software",
  "arquisoftDescription": "Asistente de docencia encargado de producir material pedagógico para los estudiantes y rediseñar el curso de Arquitectura de Software y Diseño.",
  "highSchoolGraduation": "Grado de Bachiller",
  "highSchoolDescription": "Grado como bachiller de colegio bilingüe",
  "myCertifications": "Mis certificaciones",
  "cumLaudeDiploma": "Diploma de reconocimiento Cum Laude",
  "bachelorDiploma": "Diploma de pregrado en Ingeniería de Sistemas y Computación",
  "gitDiploma": "Diploma de curso de Introducción a Git y GitHub",
  "dockerDiploma": "Diploma de curso de Docker",
  "mlIntroductionDiploma": "Diploma de curso de introducción al Machine Learning",
  "mlPracticalFundamentalsDiploma": "Diploma de curso de fundamentos prácticos del Machine Learning",
  "cvDiploma": "Diploma de curso de creación de portafolio y CV",
  "profesionalProfileDiploma": "Diploma de curso de optimización del perfil profesional",
  "personalGrowthDiploma": "Diploma de curso de herramientas para el crecimiento personal",
  "contactMe": "Contacto",
  "aboutMe": "Un poco sobre mí",
  "aboutMeText": "Soy un Tech Lead / Senior Software Engineer con pasión por la IA; convierto problemas complejos en sistemas escalables y elegantes. He liderado equipos backend, definido arquitectura de microservicios a escala y construido frameworks sólidos de pruebas automatizadas y CI/CD. Disfruto mentorear ingenieros, alinear stakeholders y construir software.",
  "tribeLead": "Líder de Tribu Backend",
  "tribeLeadDescription": "Trabajo tiempo completo liderando tres equipos de desarrollo backend, supervisando sus actividades diarias, rendimiento y crecimiento profesional",
  "tribeLeadLongDescription": "En este rol, supervisé tres equipos de desarrollo backend, supervisando sus actividades diarias, rendimiento y crecimiento profesional.",
  "tribeLeadResponsabilities": "- Tomar decisiones arquitectónicas críticas, asegurando alineación con las mejores prácticas de la industria y los objetivos a largo plazo del negocio.\n- Guiar estratégicamente a los ingenieros backend de 3 equipos de desarrollo de software para lograr hitos de proyectos.\n- Coordinar iniciativas transversales de la empresa con otros equipos para garantizar la coherencia del sistema en su conjunto.",
  "tribeLeadAchievements": "- Diseñé e implementé un estándar de arquitectura orientada a eventos a nivel de la empresa, utilizando AWS SQS/SNS para mensajería, Terraform para infraestructura como código y un enfoque monorepo para optimizar los flujos de desarrollo y garantizar la consistencia arquitectónica en todos los servicios backend.",
  "squadLead": "Líder de Squad Backend",
  "squadLeadDescription": "Trabajo tiempo completo liderando el equipo de backend responsable de mantener la versión Perú de tyba",
  "squadLeadLongDescription": "En este rol, lideré un equipo de backend responsable de mantener la versión Perú de tyba.",
  "squadLeadResponsabilities": "- Liderar el diseño y desarrollo de soluciones técnicas que aborden los requisitos del negocio. \n- Orquestar la colaboración entre equipos de negocios, operaciones y desarrollo. \n- Garantizar el correcto funcionamiento de los productos de Perú mediante el monitoreo meticuro del rendimiento y la resolución de cualquier problema que surja. \n- Mantener un alto estándar de calidad de código a través de revisiones de código, aplicación de buenas prácticas y iniciativas de mejora continua.",
  "squadLeadAchievements": "- Mejoré la implementación del patrón SAGA de la empresa, agregando acceso directo a la base de datos en el microservicio orquestador \n- Establecí la versión Perú de tyba como el producto más rentable de la empresa.",
  "midBackend": "Ingeniero Backend Medio",
  "midBackendDescription": "Trabajo tiempo completo como ingeniero backend para una empresa Fintech usada por miles de usuarios"
}
