{"pageProps":{"_nextI18Next":{"initialI18nStore":{"es":{"common":{"present":"presente","learnMore":"Ver más!","mainTitle":"Ingeniero de Sistemas, y desarrollador","myResume":"Mira mi hoja de vida!","resumeLink":"/files/HV Mateo Devia.pdf","mySkills":"Mis conocimientos","myExperience":"Mi experiencia","responsibilities":"Responabilidades","tybaRole":"Ingeniero backend","tybaDescription":"Trabajo tiempo completo como desarrollador backend en una Fintech que provee servicios de inversion a miles de usuarios","tybaLongDescription":"Actualmente me encuentro trabajando como ingeniero backend en tyba, una Fintech que se dedica a ofrecer oportunidades de inversion a sus usuarios mediante soluciones tecnológicas innovadoras.","tybaResponsibilities":"- Diseño y desarrollo de nuevas funcionalidades en la app \n- Mejoramiento continuo de los componentes de software \n- Soporte y solución de bugs en la app","tybaPage":"Página de tyba","inalambriaRole":"Ingeniero fullstack de innovación","inalambriaDescription":"Ingeniero del área de innovación encargado del diseño, concepción, e implementación de nuevos productos para la empresa.","inalambriaLongDescription":"Mi primer trabajo tiempo completo fue en Inalambria, una empresa dedicada a la mensajería instantanea. Fuí parte del equipo de Innovación, donde tuve la oportunidad de diseñar y desarrollar nuevos productos de software para la empresa.","inalambriaResponsabilities":"- Diseño y desarrollo de nuevos productos de software \n- Implementación del ambiente de CI/CD \n- Diseño de arquitecturas para productos altamente escalables \n- Mantenimiento de productos en AWS","inalambriaPage":"Página de Inalambria","cumLaudeTitle":"Grado Cum Laude","cumLaudeDescription":"Grado Cum Laude en Ingeniería de Sistemas y Computación con promedio dentro del 3% más alto en los últimos 5 años de la facultad de ingeniería","cumLaudeLongDescription":"Me gradué del pregrado de Ingeniería de Sistemas y Computación de la Universidad de los Andes con el reconocimiento Cum Laude.El reconocimiento cum laude se otorga a los estudiantes cuyo promedio ponderadao está dentro del 3% más alto de la Facultad de ingeniería en los últimos 5 años","sincoFreelance":"Contrato como independiente","sincoDescription":"Desarrollo de aplicación web para gestión de contenido multimedia, contacto con los clientes, y gestión de cursos sobre el ERP.","cupi2Title":"Asistente de investigación en Python","cupi2Description":"Asistente de Investigación encargado de administrar el centro de ayuda para estudiantes de los cursos de introducción a la programación en Python, y apoyar la migración de Java a Python en dichos cursos.","arquisoftTitle":"Monitor de arquitectura y diseño de software","arquisoftDescription":"Asistente de docencia encargado de producir material pedagógico para los estudiantes y rediseñar el curso de Arquitectura de Software y Diseño.","highSchoolGraduation":"Grado de Bachiller","highSchoolDescription":"Grado como bachiller de colegio bilingüe","myCertifications":"Mis certificaciones","cumLaudeDiploma":"Diploma de reconocimiento Cum Laude","bachelorDiploma":"Diploma de pregrado en Ingeniería de Sistemas y Computación","gitDiploma":"Diploma de curso de Introducción a Git y GitHub","dockerDiploma":"Diploma de curso de Docker","mlIntroductionDiploma":"Diploma de curso de introducción al Machine Learning","mlPracticalFundamentalsDiploma":"Diploma de curso de fundamentos prácticos del Machine Learning","cvDiploma":"Diploma de curso de creación de portafolio y CV","profesionalProfileDiploma":"Diploma de curso de optimización del perfil profesional","personalGrowthDiploma":"Diploma de curso de herramientas para el crecimiento personal","contactMe":"Contacto"}},"en":{"common":{"present":"presente","learnMore":"Learn more!","mainTitle":"Systems and Computing Engineer, and Developer","myResume":"Check my resume!","resumeLink":"/files/CV Mateo Devia.pdf","mySkills":"My Skills","myExperience":"My Experience","responsibilities":"Responsabilities","tybaRole":"Backend Engineer","tybaDescription":"Full time job as backend developer for a Fintech app used by thousands of users","tybaLongDescription":"I am currently working as a backend engineer in tyba, a Fintech startup that provides various investment and financial services to their users through innovative tech solutions.","tybaResponsibilities":"- Design and implementation of new features in the app \n- Mejoramiento continuo de los componentes de software \n- Soporte y solución de bugs en la app","tybaPage":"tyba´s home page","inalambriaRole":"Innovation Fullstack Developer","inalambriaDescription":"Full time job. Web development, product design, software design.","inalambriaLongDescription":"My first fulltime job was at Inalambria, a tech company of instant messaging. I was part of the innovation team, where I participated in the design and implementation of new software products for the company.","inalambriaResponsabilities":"- Product design and development \n- Implementación del ambiente de CI/CD \n- Diseño de arquitecturas para productos altamente escalables - Mantenimiento de productos en AWS","inalambriaPage":"Inalambria´s home page","cumLaudeTitle":"Cum Laude Bachelor Degree","cumLaudeDescription":"B.S. in Systems and Computing Engineering. Graduted with a GPA within the highest 3% in the last 5 years.","cumLaudeLongDescription":"I obtained a Cum Laude B.S degree in Systems and Computing Engineering from Universidad de los Andes. The Cum Laude recognition is given to the students who had a GPA within the highest 3% of the last 5 years in the engineering faculty","sincoFreelance":"Freelance Software development","sincoDescription":"Developed a content management web tool with hight standards of security, maintainability, and extensibility.","cupi2Title":"Python Research Assitant","cupi2Description":"Research assistant on the curriculum migration from Java to Python for the introductory programming courses.","arquisoftTitle":"Software Architecture Teaching Assistant","arquisoftDescription":"Teaching Assistant focused on producing teaching material for students, and general redesigning of the Software Architecture and Design course","highSchoolGraduation":"High School Graduation","highSchoolDescription":"Graduated from high school in a bilingual school in Colombia","myCertifications":"My Certifications","cumLaudeDiploma":"Cum Laude Recognition Diploma","bachelorDiploma":"B.S. in Systems and Computing Engineering Diploma","gitDiploma":"Git and Github Introduction Course Diploma","dockerDiploma":"Docker Course Diploma","mlIntroductionDiploma":"Introduction to Machine Learning Course Diploma","mlPracticalFundamentalsDiploma":"Practical Fundamentals of Machine Learning Course Diploma","cvDiploma":"Portfolio and CV creation Course Diploma","profesionalProfileDiploma":"Professional Profile Optimization Course Diploma","personalGrowthDiploma":"Personal Growth Development Course Diploma","contactMe":"Contact Me"}}},"userConfig":{"i18n":{"defaultLocale":"en","locales":["en","es"]}}}},"__N_SSG":true}