{
  "present": "present",
  "learnMore": "Learn more!",
  "mainTitle": "I am a Software Developer!",
  "myResume": "Check my resume!",
  "softwareEngineer": "Software Engineer",
  "resumeLink": "/files/CV Mateo Devia.pdf",
  "mySkills": "My Skills",
  "myExperience": "My Experience",
  "responsibilities": "Responsabilities",
  "achievements": "Achievements",
  "tybaLongDescription": "I worked as a backend engineer in tyba, a Fintech startup that provides various investment and financial services to their users through innovative tech solutions.",
  "tybaResponsibilities": "- Design and implementation of new features in the app \n- Continuous improvement of the backend microservices \n- Bug fixing and support",
  "tybaPage": "tyba´s home page",
  "inalambriaRole": "Innovation Fullstack Developer",
  "inalambriaDescription": "Full time job. Web development, product design, software design.",
  "inalambriaLongDescription": "My first fulltime job was at Inalambria, a tech company of instant messaging. I was part of the innovation team, where I participated in the design and implementation of new software products for the company.",
  "inalambriaResponsabilities": "- Product design and development \n- Design and implementation of the CI/CD pipelines \n- Maintenance of products in AWS \n- Architectural design and implementation of highly scalable products",
  "inalambriaPage": "Inalambria´s home page",
  "cumLaudeTitle": "Cum Laude Bachelor Degree",
  "cumLaudeDescription": "B.S. in Systems and Computing Engineering. Graduted with a GPA within the highest 3% in the last 5 years.",
  "cumLaudeLongDescription": "I obtained a Cum Laude B.S degree in Systems and Computing Engineering from Universidad de los Andes. The Cum Laude recognition is given to the students who had a GPA within the highest 3% of the last 5 years in the engineering faculty",
  "sincoFreelance": "Freelance Software development",
  "sincoDescription": "Developed a content management web tool with hight standards of security, maintainability, and extensibility.",
  "cupi2Title": "Python Research Assitant",
  "cupi2Description": "Research assistant on the curriculum migration from Java to Python for the introductory programming courses.",
  "arquisoftTitle": "Software Architecture Teaching Assistant",
  "arquisoftDescription": "Teaching Assistant focused on producing teaching material for students, and general redesigning of the Software Architecture and Design course",
  "highSchoolGraduation": "High School Graduation",
  "highSchoolDescription": "Graduated from high school in a bilingual school in Colombia",
  "myCertifications": "My Certifications",
  "cumLaudeDiploma": "Cum Laude Recognition Diploma",
  "bachelorDiploma": "B.S. in Systems and Computing Engineering Diploma",
  "gitDiploma": "Git and Github Introduction Course Diploma",
  "dockerDiploma": "Docker Course Diploma",
  "mlIntroductionDiploma": "Introduction to Machine Learning Course Diploma",
  "mlPracticalFundamentalsDiploma": "Practical Fundamentals of Machine Learning Course Diploma",
  "cvDiploma": "Portfolio and CV creation Course Diploma",
  "profesionalProfileDiploma": "Professional Profile Optimization Course Diploma",
  "personalGrowthDiploma": "Personal Growth Development Course Diploma",
  "contactMe": "Contact Me",
  "aboutMe": "A little about me",
  "aboutMeText": "I’m a Tech Lead / AI-minded Senior Software Engineer who loves turning complex problems into scalable, elegant systems. I’ve led backend teams, defined software architecture for microservices at scale, and built strong testing/CI frameworks. I enjoy mentoring engineers, aligning stakeholders, and building software.",
  "chapterLead": "Head of Backend",
  "chapterLeadDescription": "Full time job leading a team of 26 engineers building a serverless microservice-based investment platform.",
  "chapterLeadLongDescription": "In this role, I lead a team of 26 engineers building a microservice-based investment platform and modern APIs in a serverless architecture using typescript, AWS, github actions, among others.",
  "chapterLeadResponsabilities": "- Steering major architectural decisions for the backend components, adhering to industry best practices. \n- Technical enablement for all the backend tools to improve the developer experience (DX), and overall development efficiency. \n- Orchestrating and supervising the 9 squads of the company to ensure alignment with company priorities. \n- Distributing devs efficiently among the different backend teams to maximize productivity and meet project deadlines. \n- Championing the career growth of our backend engineers by providing mentorship and guidance.",
  "chapterLeadAchievements": "- Designed and implemented a robust AI framework and architecture for the company, leveraging MCP and Langchain to enable advanced AI-driven solutions across the organization.",
  "tribeLead": "Backend Tribe Lead",
  "tribeLeadDescription": "Full time job supervising three backend development teams, overseeing their day-to-day activities, performance, and professional growth",
  "tribeLeadLongDescription": "In this role, I supervised three backend development teams, overseeing their day-to-day activities, performance, and professional growth.",
  "tribeLeadResponsabilities": "- Making critical architectural decisions, ensuring alignment with industry best practices and long-term business goals.\n- Strategically guiding the backend engineers of 3 software development squads to achieve project milestones. \n- Coordinating cross-functional initiatives of the company with other teams to ensure coherence among the overall system.",
  "tribeLeadAchievements": "- Designed and implemented a company-wide event-driven architecture standard, leveraging AWS SQS/SNS for messaging, Terraform for infrastructure as code, and a monorepo approach to streamline development workflows and ensure architectural consistency across all backend services.",
  "squadLead": "Backend Squad Lead",
  "squadLeadDescription": "Full time job leading a backend team responsible for maintaining the Peru versión of tyba",
  "squadLeadLongDescription": "In this role, I led a backend team responsible for maintaining the Peru versión of tyba.",
  "squadLeadResponsabilities": "- Leading the design and development of technical solutions that address business requirements. \n- Orchestrating cross-functional collaboration between business, operations, and development teams. \n- Ensuring the correct operation of the Peru products by meticulously monitoring performance and addressing any issues that arise. \n- Upholding a high standard of code quality through code reviews, best practices enforcement, and continuous improvement initiatives.",
  "squadLeadAchievements": "- Improved the SAGA Pattern implementation of the company, by adding direct access to DB in the orchestrator microservice \n- Stablished the Peru version of tyba, as the most profitable product in the company.",
  "midBackend": "Mid Backend Developer",
  "midBackendDescription": "Full time job as backend developer for a Fintech company used by thousands of users"
}
