{
  "present": "presente",
  "learnMore": "Ver más!",
  "mainTitle": "Soy un Desarrollador de Software",
  "myResume": "Mira mi hoja de vida!",
  "softwareEngineer": "Ingeniero de Software",
  "resumeLink": "/files/HV Mateo Devia.pdf",
  "mySkills": "Mis conocimientos",
  "myExperience": "Mi experiencia",
  "responsibilities": "Responsabilidades",
  "achievements": "Logros",
  "tybaLongDescription": "Trabajé como ingeniero backend en tyba, una Fintech que se dedica a ofrecer oportunidades de inversion a sus usuarios mediante soluciones tecnológicas innovadoras.",
  "tybaResponsibilities": "- Diseño y desarrollo de nuevas funcionalidades en la app \n- Mejoramiento continuo de los componentes de software \n- Soporte y solución de bugs en la app",
  "tybaPage": "Página de tyba",
  "inalambriaRole": "Ingeniero fullstack de innovación",
  "inalambriaDescription": "Trabajo de tiempo completo. Desarrollo web, diseño de producto y diseño de software.",
  "inalambriaLongDescription": "Mi primer trabajo de tiempo completo fue en Inalambria, una empresa de tecnología de mensajería instantanea. Hice parte del equipo de innovación, donde participé en el diseño e implementación de nuevos productos de software para la empresa.",
  "inalambriaResponsibilities": "- Diseño y desarrollo de nuevos productos de software \n- Implementación del ambiente de CI/CD \n- Diseño de arquitecturas para productos altamente escalables \n- Mantenimiento de productos en AWS",
  "inalambriaPage": "Página principal de Inalambria",
  "cumLaudeTitle": "Grado Cum Laude",
  "cumLaudeDescription": "Ingeniero de Sistemas y Computación. Graduado con un promedio dentro del 3% más alto de los últimos 5 años.",
  "cumLaudeLongDescription": "Me gradué del pregrado de Ingeniería de Sistemas y Computación de la Universidad de los Andes con el reconocimiento Cum Laude.El reconocimiento cum laude se otorga a los estudiantes cuyo promedio ponderadao está dentro del 3% más alto de la Facultad de ingeniería en los últimos 5 años",
  "sincoFreelance": "Contrato como independiente",
  "sincoDescription": "Desarrollo de aplicación web para gestión de contenido multimedia, contacto con los clientes, y gestión de cursos sobre el ERP.",
  "cupi2Title": "Asistente de investigación en Python",
  "cupi2Description": "Asistente de Investigación encargado de administrar el centro de ayuda para estudiantes de los cursos de introducción a la programación en Python, y apoyar la migración de Java a Python en dichos cursos.",
  "arquisoftTitle": "Monitor de arquitectura y diseño de software",
  "arquisoftDescription": "Asistente de docencia encargado de producir material pedagógico para los estudiantes y rediseñar el curso de Arquitectura de Software y Diseño.",
  "highSchoolGraduation": "Grado de Bachiller",
  "highSchoolDescription": "Grado como bachiller de colegio bilingüe",
  "myCertifications": "Mis certificaciones",
  "cumLaudeDiploma": "Diploma de reconocimiento Cum Laude",
  "bachelorDiploma": "Diploma de Ingeniero de Sistemas y Computación",
  "gitDiploma": "Diploma de curso de introducción a Git y Github",
  "dockerDiploma": "Diploma de curso de Docker",
  "mlIntroductionDiploma": "Diploma de curso de Introducción a Machine Learning",
  "mlPracticalFundamentalsDiploma": "Diploma de curso de Fundamentos Prácticos de Machine Learning",
  "cvDiploma": "Diploma de curso de creación de portafolio y CV",
  "professionalProfileDiploma": "Diploma de curso de optimización del perfil profesional",
  "personalGrowthDiploma": "Diploma de curso de Herramientas para el Crecimiento Personal",
  "contactMe": "Contáctame",
  "aboutMe": "Un poco sobre mi",
  "aboutMeText": "Soy un Tech Lead / Senior Software Engineer con pasión por la IA; convierto problemas complejos en sistemas escalables y elegantes. He liderado equipos backend, definido arquitectura de microservicios a escala y construido frameworks sólidos de pruebas automatizadas y CI/CD. Disfruto mentorear ingenieros, alinear stakeholders y construir software.",
  "chapterLead": "Head de Backend",
  "chapterLeadDescription": "Trabajo de tiempo completo liderando un equipo de 26 ingenieros construyendo una plataforma de inversión sin servidor basada en microservicios.",
  "chapterLeadLongDescription": "En este rol, lidero un equipo de 26 ingenieros construyendo una plataforma de inversión basada en microservicios y APIs modernas en una arquitectura sin servidor utilizando TypeScript, AWS, GitHub Actions, entre otros.",
  "chapterLeadResponsibilities": "- Dirigir decisiones arquitectónicas importantes para los componentes del backend, asegurando el cumplimiento de las mejores prácticas de la industria. \n- Habilitar la tecnología para todos los herramientas del backend para mejorar la experiencia del desarrollador (DX), y la eficiencia general del desarrollo. \n- Orquestar y supervisar los 9 equipos de la empresa para garantizar la alineación con los objetivos de la empresa. \n- Distribuir eficientemente a los desarrolladores entre los diferentes equipos de backend para maximizar la productividad y cumplir con los plazos de los proyectos. \n- Promover el crecimiento profesional de nuestros ingenieros backend mediante la provisión de orientación y guía.",
  "chapterLeadAchievements": "- Diseñé e implementé un robusto marco de trabajo y arquitectura de IA para la empresa, aprovechando MCP y LangChain para habilitar soluciones avanzadas impulsadas por IA en toda la organización. \n- Impulsé el uso de arquitecturas limpias para los nuevos microservicios de la empresa. Habilitando el desarrollo más rápido y la facilidad de mantenimiento.",
  "tribeLead": "Líder de Tribu Backend",
  "tribeLeadDescription": "Trabajo de tiempo completo supervisando tres equipos de desarrollo backend, supervisando sus actividades diarias, rendimiento y crecimiento profesional.",
  "tribeLeadLongDescription": "En este rol, supervisé a tres equipos de desarrollo backend, supervisando sus actividades diarias, rendimiento y crecimiento profesional.",
  "tribeLeadResponsibilities": "- Tomar decisiones arquitectónicas críticas, asegurando alineación con las mejores prácticas de la industria y los objetivos a largo plazo del negocio.\n- Guiar estratégicamente a los ingenieros backend de 3 equipos de desarrollo de software para lograr hitos de proyectos.\n- Coordinar iniciativas transversales de la empresa con otros equipos para garantizar la coherencia del sistema en su conjunto.",
  "tribeLeadAchievements": "- Diseñé e implementé un estándar de arquitectura orientada a eventos para toda la empresa, utilizando AWS SQS/SNS para mensajería, Terraform para infraestructura como código y un enfoque de monorepo para agilizar los flujos de trabajo de desarrollo y garantizar la coherencia arquitectónica en todos los servicios de backend.",
  "squadLead": "Líder de Equipo Backend",
  "squadLeadDescription": "Trabajo de tiempo completo liderando un equipo backend responsable de mantener la versión de tyba para Perú.",
  "squadLeadLongDescription": "En este rol, lideré un equipo backend responsable de mantener la versión de tyba para Perú.",
  "squadLeadResponsibilities": "- Liderar el diseño y desarrollo de soluciones técnicas que aborden los requisitos del negocio. \n- Orquestar la colaboración entre equipos de negocios, operaciones y desarrollo. \n- Garantizar el correcto funcionamiento de los productos de Perú mediante el monitoreo meticuro del rendimiento y la resolución de cualquier problema que surja. \n- Mantener un alto estándar de calidad de código a través de revisiones de código, aplicación de buenas prácticas y iniciativas de mejora continua.",
  "squadLeadAchievements": "- Mejoré la implementación del Patrón SAGA de la empresa, agregando acceso directo a la base de datos en el microservicio orquestador. \n- Establecí la versión de tyba para Perú como el producto más rentable de la empresa.",
  "midBackend": "Desarrollador Backend Mid",
  "midBackendDescription": "Trabajo de tiempo completo como desarrollador backend para una empresa Fintech utilizada por miles de usuarios.",
  "captaTitle": "Co Fundador, Ingeniero de Software y Diseñador de Producto",
  "captaDescription": "Co-fundé una plataforma que automatiza las reclamaciones de clientes y las operaciones de soporte técnico.",
  "captaLongDescription": "Capta es una plataforma que automatiza las reclamaciones de clientes y las operaciones de soporte técnico a través de flujos de trabajo configurables, reglas de SLA y análisis.",
  "captaResponsibilities": "- Contribuir al desarrollo del primer MVP del producto. \n- Diseñar la interfaz de usuario/UX en Figma y establecer un sistema de diseño ligero para garantizar consistencia y velocidad. \n- Configurar procesos de entrega y herramientas para planificar sprints (JIRA + flujos de desarrollo)",
  "captaPage": "Página principal de Capta"
}
